***Scenario 1:***

It is going to be a huge Saturday and there will need to be many more cars on the road than last week. In order to get drivers to go online, we're assessing the following two bonus options in terms of cost:

**Option 1:** 
<br>
\\$50 for each driver that is online at least 8 hours, accepts 90\% of requests, completes 10 trips, and has a rating of 4.7 or better during the time frame.

**Option 2:**
<br>
\\$4/trip for all drivers who complete 12 trips, and have a 4.7 or better rating.
Using the dataset provided and given Scenario 1, provide answers to the questions below:

1. How much would the total bonus payout be with Option 1?
2. How much would the total bonus payout be with Option 2?
3. How many drivers would qualify for a bonus under Option 1 but not under Option 2?
4. What percentages of drivers online completed less than 10 trips, had an acceptance rate of less than 90%, and had a rating of 4.7 or higher?

In [118]:
import pandas as pd

In [119]:
df = pd.read_csv('dataset.csv')

In [120]:
df.head()

      Name  Trips Completed Accept Rate  Supply Hours  Rating
0    Abdul                1        100%             3     4.8
1  Abraham               12         83%             5     4.7
2  Adelina                1        100%             2     4.7
3   Akilah                1        100%             2     4.9
4     Alec               21         76%            11     5.0

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             119 non-null    object
 1   Trips Completed  119 non-null    int64
 2   Accept Rate      119 non-null    object
 3   Supply Hours     119 non-null    int64
 4   Rating           119 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.8+ KB

In [122]:
# convert accept rate to float from string to force conditions later
df['Accept Rate'] = df['Accept Rate'].apply(lambda x: float(x[:-1]))
df

         Name  Trips Completed  Accept Rate  Supply Hours  Rating
0       Abdul                1        100.0             3     4.8
1     Abraham               12         83.0             5     4.7
2     Adelina                1        100.0             2     4.7
3      Akilah                1        100.0             2     4.9
4        Alec               21         76.0            11     5.0
..        ...              ...          ...           ...     ...
114    Virgen                4        100.0             6     4.5
115      Yang                7         71.0             2     4.5
116  Yessenia                8         88.0             5     5.0
117    Yukiko                9         78.0             6     4.5
118       Zoe               21         86.0             9     4.9

[119 rows x 5 columns]

***1. How much would the total bonus payout be with Option 1?***

In [123]:
option1 = df[(df['Supply Hours'] >= 8) & 
          (df['Accept Rate'] >= 90) & 
          (df['Rating'] >= 4.7) & 
          (df['Trips Completed'] >= 10)]

In [124]:
option1_cost = 50 * len(option1)
print('Total Cost for Scenario 1 : $' + str(option1_cost))

Total Cost for Scenario 1 : $1050

***2. How much would the total bonus payout be with Option 2?***

In [125]:
option2 = df[(df['Trips Completed'] >= 12) & (df['Rating'] >= 4.7)]

In [126]:
option2.head()

       Name  Trips Completed  Accept Rate  Supply Hours  Rating
1   Abraham               12         83.0             5     4.7
4      Alec               21         76.0            11     5.0
8   Augusta               19         84.0            11     4.7
10    Buffy               13         54.0             6     5.0
11    Byron               15        100.0            10     4.9

In [127]:
option2_cost = 4 * sum(option2['Trips Completed'])
print("Total Cost for Scenario 2 : $" + str(option2_cost))

Total Cost for Scenario 2 : $2976

***3. How many drivers would qualify for a bonus under Option 1 but not under Option 2?***

In [128]:
joined = option1.merge(option2, on = 'Name', how = 'left', indicator= True)

In [129]:
joined.head()

,Name,Trips Completed_x,Accept Rate_x,Supply Hours_x,Rating_x,Trips Completed_y,Accept Rate_y,Supply Hours_y,Rating_y,_merge
0,Byron,15,100.0,10,4.9,15.0,100.0,10.0,4.9,both
1,Carlota,14,100.0,8,5.0,14.0,100.0,8.0,5.0,both
2,Dannette,14,100.0,9,4.9,14.0,100.0,9.0,4.9,both
3,Demetrius,14,100.0,9,5.0,14.0,100.0,9.0,5.0,both
4,Dimple,15,100.0,10,4.9,15.0,100.0,10.0,4.9,both

In [130]:
joined['_merge'].value_counts()

both          19
left_only      2
right_only     0
Name: _merge, dtype: int64

In [131]:
joined[joined['_merge'] == 'left_only']

,Name,Trips Completed_x,Accept Rate_x,Supply Hours_x,Rating_x,Trips Completed_y,Accept Rate_y,Supply Hours_y,Rating_y,_merge
16,Oren,11,91.0,9,4.8,NaN,NaN,NaN,NaN,left_only
17,Phyllis,10,90.0,8,4.8,NaN,NaN,NaN,NaN,left_only

***4. What percentages of drivers online completed less than 10 trips, had an acceptance rate of less than \\90%, and had a rating of 4.7 or higher?***

In [136]:
option3 = df[(df['Trips Completed'] < 10) &
               (df['Accept Rate'] < 90) &
               (df['Rating'] >= 4.7)
              ]

In [137]:
percent_drivers = (len(option3)/len(df))*100

In [138]:
print(str(percent_drivers) +'%')

10.92436974789916%

***Scenario 2:*** 

A taxi driver currently generates \\$200 per day in fares (before expenses), works six days a week, takes three weeks off, and has the following expenses:
<br>
Gas - \\$200 per week <br>
Insurance - \\$400 per month <br>
Vehicle rent (by the week) - \\$500 <br>
The driver doesn't pay gas and rent expenses on off weeks. <br> <br>

Now, let's assume that the same driver would buy a Town Car and partner with Uber. If he does, his gas expenses would go up by 5%, his insurance expense would decrease by 20%, and he would no longer be renting a vehicle. However, he would need to buy a car. The driver would still take three weeks off per year. <br>

Given Scenario 2, provide answers to the questions below: <br>

5. How much money (after expenses) does the taxi driver make per year without partnering with Uber?
6. You are convincing the same driver above to buy a Town Car and partner with Uber. Assuming the new car is 40.000 USD, how much would the driver's gross fares need to increase per week to fully pay for the car in year 1 and maintain the same yearly profit margin as before?

In [143]:
#Defining the variables
revenue = 200
gas = 200
insurance = 400
vehicle_rent = 500

***5. How much money (after expenses) does the taxi driver make per year without partnering with Uber?***

In [171]:
# Without Partnering with Uber
# Assuming the driver works for 49 weeks per year

gas_wou = gas * 49
insurance_wou = insurance*12
vehicle_rent_wou = vehicle_rent * 49
income_earned_wou = 200 * 49 * 6

profit_margin = income_earned_wou - gas_wou - vehicle_rent_wou - insurance_wou

In [172]:
print('Revenue earnings before Uber: $' + str(income_earned_wou))

Revenue earnings before Uber: $58800

In [173]:
print('Profit Margin without partnering with Uber: $' + str(profit_margin))

Profit Margin without partnering with Uber: $19700

***6. You are convincing the same driver above to buy a Town Car and partner with Uber. Assuming the new car is 40.000 USD, how much would the driver's gross fares need to increase per week to fully pay for the car in year 1 and maintain the same yearly profit margin as before?***

In [176]:
#Recalculating Gas, Insurance, Vehicle Rental etc to when partnering with Uber
#New Profit Margin is calculated assuming the Income earned is the same as older income 
gas_wu = gas_wou + gas_wou*(0.05)
insurance_wu = insurance_wou - insurance_wou*(0.20)
new_car = 40000

In [177]:
expenses_wu = 40000 + gas_wu + insurance_wu

In [178]:
print('New Expenses: $'+ str(expenses_wu))

New Expenses: $54130.0

In [179]:
print('New Profit Margin: $' + str(income_earned_wou - expenses_wu ))

New Profit Margin: $4670.0

In [182]:
print('Gross Earnings per week need to increase by: $'+ str((profit_margin - (income_earned_wou - expenses_wu))/49))

Gross Earnings per week need to increase by: $306.734693877551